// Lab 3.4
// < Верхоляк Дмитро Юрійович > 
// Лабораторна робота № 3.4 
// Розгалуження, задане плоскою фігурою (Варіант 2). 

#include <iostream>
#include <cmath> // Для математичних операцій, якщо вони знадобляться
using namespace std;

int main()
{
    double x;  
    double y;  
    double R;  

    cout << "R = "; cin >> R;
    cout << "x = "; cin >> x;
    cout << "y = "; cin >> y;

    // Перевірка R > 0
    if (R <= 0) {
        cout << "R має бути додатнім." << endl;
        return 1;
    }

    // УМОВА ПОПАДАННЯ

    bool is_in_area =
        // УМОВА 1: Сектор кола (II квадрант)
        (
            (x <= 0) &&                              // x <= 0
            (y >= 0) &&                              // y >= 0
            (x * x + y * y <= R * R)                 // В межах кола
            )
        ||                                           // АБО
        // УМОВА 2: Трикутник (IV квадрант)
        (
            (y <= 0) &&                              // y <= 0
            (y >= 2.0 * x) &&                        // Вище лінії y = 2x
            (y >= -2.0 * x)                          // Вище лінії y = -2x
            );


    // Розгалуження в повній формі
    if (is_in_area)
    {
        cout << "yes (Точка потрапляє в область)" << endl;
    }
    else
    {
        cout << "no (Точка НЕ потрапляє в область)" << endl;
    }

  
    return 0;
}